УТ_для_edt/src/ExchangePlans/смартОбменССервисомРечевойАналитикиDeeray/смартОбменССервисомРечевойАналитикиDeeray.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExchangePlan thisNode="cf5926a7-95b6-436c-9502-ceff69041970">
  <name>смартОбменССервисомРечевойАналитикиDeeray</name>
  <comment>#4570 смарт: Ермаков 09.10.2025</comment>
  <attributes>
    <name>Активно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаСостоянийИнтересов</name>
    <type>
      <types>CatalogRef.CRM_СостоянияИнтересов</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресAPIDeeray</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТокенAPIDeeray</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SecretKeyAPIDeeray</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиОтбора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьРегламентныеЗадания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторРегламентногоЗадания</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСхемыКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастроекКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайламЗагрузки</name>
    <comment>#4942 смарт: Тимофеева 10.11.2025 / Загрузка суммарных данных Deeray</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыгружаемыеТеги</name>
    <comment># смарт: Ермаков 09.10.2025</comment>
    <attributes>
      <name>Тег</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПоля</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ExchangePlan>

УТ_для_edt/src/ExchangePlans/смартОбменССервисомРечевойАналитикиDeeray/Forms/ФормаУзла/Module.bsl
/////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Создается новый элемент
	Если НЕ ЭтоАдресВременногоХранилища(АдресСКД) Тогда		
		// Копированием
		Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда 		
			// При копировании схема компоновки данных получается из копируемого объекта
			СхемаИсточника = Параметры.ЗначениеКопирования.ХранилищеСхемыКомпоновкиДанных.Получить();			
		Иначе  			
			// Создается новая схема компоновки данных
			СхемаИсточника = ПланыОбмена.смартОбменССервисомРечевойАналитикиDeeray.ПолучитьМакет("ОтборЗвонков"); 		
		КонецЕсли;
		
		АдресСКД = ПоместитьВоВременноеХранилище(СхемаИсточника, УникальныйИдентификатор);
		
	КонецЕсли;
	
	// Создается новый элемент
	Если НЕ ЭтоАдресВременногоХранилища(АдресНастроекСКД) Тогда  	
		// Копированием
		Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда   		
			// При копировании схема компоновки данных получается из копируемого объекта
			НастройкиКомпоновкиДанных = Параметры.ЗначениеКопирования.ХранилищеНастроекКомпоновкиДанных.Получить();  		
		Иначе              		
			// Создается новая схема компоновки данных
			НастройкиКомпоновкиДанных = Неопределено;    		
		КонецЕсли;
		
		Если НастройкиКомпоновкиДанных <> Неопределено Тогда
			АдресНастроекСКД = ПоместитьВоВременноеХранилище(НастройкиКомпоновкиДанных, УникальныйИдентификатор);
		КонецЕсли; 
		
	КонецЕсли;  
	
	ПараметрыВыбораТега = Новый Массив;
	ПараметрыВыбораТега.Добавить(Новый ПараметрВыбора("Отбор.НаборСвойств", 
				Справочники.НаборыДополнительныхРеквизитовИСведений.НайтиПоРеквизиту("ИмяПредопределенногоНабора", "Документ_ТелефонныйЗвонок"))); 
	Элементы.ВыгружаемыеТегиТег.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбораТега);

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	СхемаИсточника = ТекущийОбъект.ХранилищеСхемыКомпоновкиДанных.Получить();
		
	НастройкиКомпоновкиДанных = ТекущийОбъект.ХранилищеНастроекКомпоновкиДанных.Получить();
	
	// Загрузка схемы компоновки данных
	АдресСКД = ПоместитьВоВременноеХранилище(СхемаИсточника, УникальныйИдентификатор);
	АдресНастроекСКД = "";
	Если НастройкиКомпоновкиДанных <> Неопределено Тогда
		АдресНастроекСКД = ПоместитьВоВременноеХранилище(НастройкиКомпоновкиДанных, УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресСКД);
	// Сохранение схемы компоновки данных
	ТекущийОбъект.ХранилищеСхемыКомпоновкиДанных = Новый ХранилищеЗначения(СхемаКомпоновкиДанных);  
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	Попытка
		КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	Исключение
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Компоновка настроек узла обмена с Deeray'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	КомпоновщикНастроек.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
	Если ЭтоАдресВременногоХранилища(АдресНастроекСКД) Тогда
	
		НастройкиКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресНастроекСКД);
		Если ОбщегоНазначения.ЗначениеВСтрокуXML(КомпоновщикНастроек.ПолучитьНастройки()) <> ОбщегоНазначения.ЗначениеВСтрокуXML(НастройкиКомпоновкиДанных) Тогда
			ТекущийОбъект.ХранилищеНастроекКомпоновкиДанных = Новый ХранилищеЗначения(НастройкиКомпоновкиДанных);
		Иначе
			ТекущийОбъект.ХранилищеНастроекКомпоновкиДанных = Новый ХранилищеЗначения(Неопределено);
		КонецЕсли;
	Иначе
	
		ТекущийОбъект.ХранилищеНастроекКомпоновкиДанных = Новый ХранилищеЗначения(Неопределено);
	
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

/////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Редактировать(Команда)

	ЗаголовокФормыНастройкиСхемыКомпоновкиДанных = СтрШаблон(НСтр("ru = 'Настройки отбора узла ""%1""'"), Объект.Наименование);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("АдресСхемыКомпоновкиДанных",                АдресСКД);
	ПараметрыФормы.Вставить("АдресНастроекКомпоновкиДанных",             АдресНастроекСКД);
	ПараметрыФормы.Вставить("ИсточникШаблонов",                          Неопределено);
	ПараметрыФормы.Вставить("Заголовок",                                 ЗаголовокФормыНастройкиСхемыКомпоновкиДанных);
	ПараметрыФормы.Вставить("УникальныйИдентификатор",                   УникальныйИдентификатор);
	ПараметрыФормы.Вставить("ИмяШаблонаСКД",                             Неопределено);
	ПараметрыФормы.Вставить("ВозвращатьИмяТекущегоШаблонаСКД",           Истина);
	ПараметрыФормы.Вставить("ВозвращатьПолноеИмяТекущегоШаблонаСКД",     Истина);
	ПараметрыФормы.Вставить("НеНастраиватьУсловноеОформление",           Истина);
	ПараметрыФормы.Вставить("НеНастраиватьПорядок",                      Истина);
	ПараметрыФормы.Вставить("НеПомещатьНастройкиВСхемуКомпоновкиДанных", Истина);
	
	Оповещение = Новый ОписаниеОповещения("РедактироватьЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.УпрощеннаяНастройкаСхемыКомпоновкиДанных",
		ПараметрыФормы, 
		ЭтаФорма,,,,
		Оповещение,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ИнициализаироватьОтборы(Команда)
	ИнициализаироватьОтборыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КВыгрузке(Команда)  
	Если ЭтаФорма.Модифицированность Тогда
		Оповещение = Новый ОписаниеОповещения("ПоказатьТаблицуКВыгрузкеДалее", ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'Необходимо записать текущий узел обмена. Записать?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
	Иначе
		ПоказатьТаблицуКВыгрузке(Объект.Ссылка); 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьСоставОтправляемыхДанных(Команда)
	ОчиститьСоставОтправляемыхДанныхНаСервере();
КонецПроцедуры 

#КонецОбласти

/////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РедактироватьЗавершение(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат <> Неопределено Тогда
	
		АдресНастроекСКД = Результат.АдресХранилищаНастройкиКомпоновщика;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьТаблицуКВыгрузкеДалее(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат = КодВозвратаДиалога.Да Тогда
	
		Записать();
		ПоказатьТаблицуКВыгрузке(Объект.Ссылка); 

	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИнициализаироватьОтборыНаСервере()
	УстановитьПривилегированныйРежим(Истина);
	
	СхемаКомпоновкиДанных = ПланыОбмена.смартОбменССервисомРечевойАналитикиDeeray.ПолучитьМакет("ОтборЗвонков");
	
	УстановитьПривилегированныйРежим(Ложь);
	
	ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, АдресСКД);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьТаблицуКВыгрузке(УзелОбмена)  
	
    ТабДокумент = Новый ТабличныйДокумент;
	СформироватьПечатнуюФормуКВыгрузкеНаСервере(ТабДокумент, УзелОбмена);
	ТабДокумент.Показать();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьПечатнуюФормуКВыгрузкеНаСервере(ТабличныйДокумент, УзелОбмена, ПользовательскиеНастройки = Неопределено)
	
	ПланыОбмена.смартОбменССервисомРечевойАналитикиDeeray.ВыбратьДанныеВТабличныйДокумент(УзелОбмена, ТабличныйДокумент);
			
КонецПроцедуры

&НаСервере
Процедура ОчиститьСоставОтправляемыхДанныхНаСервере()   
	
	ДанныеДляВыгрузки 	= ПланыОбмена.смартОбменССервисомРечевойАналитикиDeeray.ВыбратьДанные(Объект.Ссылка);
	УдалитьРегистрациюСНевалидныхОбъектов(Объект.Ссылка, ДанныеДляВыгрузки);
	
КонецПроцедуры

&НаСервере
Процедура УдалитьРегистрациюСНевалидныхОбъектов(УзелОбмена, ДанныеДляВыгрузки) 
    Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТелефонныйЗвонокИзменения.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_ВсеИзменения
	|ИЗ
	|	Документ.ТелефонныйЗвонок.Изменения КАК ТелефонныйЗвонокИзменения
	|ГДЕ
	|	ТелефонныйЗвонокИзменения.Узел = &Узел
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДляВыгрузки.ТелефонныйЗвонок КАК Ссылка
	|ПОМЕСТИТЬ ВТ_ВыгружаемыеИзменения
	|ИЗ
	|	&ДанныеДляВыгрузки КАК ДанныеДляВыгрузки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВсеИзменения.Ссылка КАК Ссылка
	|ИЗ
	|	ВТ_ВсеИзменения КАК ВТ_ВсеИзменения
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВыгружаемыеИзменения КАК ВТ_ВыгружаемыеИзменения
	|		ПО ВТ_ВсеИзменения.Ссылка = ВТ_ВыгружаемыеИзменения.Ссылка
	|ГДЕ
	|	ВТ_ВыгружаемыеИзменения.Ссылка ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("Узел", УзелОбмена);
	Запрос.УстановитьПараметр("ДанныеДляВыгрузки", ДанныеДляВыгрузки); 
	МассивЗвонков = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	Если МассивЗвонков.Количество() > 0 Тогда
		ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбмена, МассивЗвонков);
	КонецЕсли;
Конецпроцедуры

#КонецОбласти
